def is_positive(x):
    return x > 0

num = [-3, -2, -1, 0, 1, 2, 3, 4, 5]
positive_num = list(filter(is_positive, num))
print(positive_num)  


#Типо выводить позитивные числа, очень оригинально, знаю


#Условие:
#Напишите фильтр положительных чисел
